eldarkg/emdr1986x-std-per-lib/MDR32F8_StdPeriph_Driver/src/mdr32f8_tim.c
  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM0_CLK = tmpreg;
	}
	
	if (TIMx==TIM1){
  tmpreg = CLK_CNTR->TIM1_CLK;

  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM1_CLK = tmpreg;
	}
	
	if (TIMx==TIM2){
  tmpreg = CLK_CNTR->TIM2_CLK;

  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM2_CLK = tmpreg;
	}
	
	if (TIMx==TIM3){
  tmpreg = CLK_CNTR->TIM3_CLK;

  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM3_CLK = tmpreg;
	}
	
}

void  TIMER_BRGInit (MDR_TMR_TypeDef* TIMERx, uint32_t TIM_CLK_DIV)
{
  uint32_t tmpreg;

	if (TIMERx == MDR_TMR0){
  tmpreg = CLK_CNTR->TIM0_CLK;

  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM0_CLK = tmpreg;
	}
	
	if (TIMERx==MDR_TMR1){
  tmpreg = CLK_CNTR->TIM1_CLK;

  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM1_CLK = tmpreg;
	}
	
	if (TIMERx==MDR_TMR2){
  tmpreg = CLK_CNTR->TIM2_CLK;

  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM2_CLK = tmpreg;
	}
	
	if (TIMERx==MDR_TMR3){
  tmpreg = CLK_CNTR->TIM3_CLK;

  tmpreg |=  TIM_CLK_EN;
  tmpreg &= ~TIM_DIV_Msk;
  tmpreg |=  TIM_CLK_DIV;

  CLK_CNTR->TIM3_CLK = tmpreg;
	}

}

/** @} */ /* End of group TIMER_Private_Functions */

/** @} */ /* End of group TIMER */

/** @} */ /* End of group __MDR32F9Qx_StdPeriph_Driver */

/******************* (C) COPYRIGHT 2010 Phyton *********************************
*
* END OF FILE MDR32F9Qx_timer.c */

